docs/index.org
#+title: KHELSE function
#+date: 19.03.2020

#+options: ^:nil
#+OPTIONS: html-postamble:nil
#+LANGUAGE: no
#+STARTUP: shrink

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup


Gjennomgang av funksjoner brukes i KHELSE funksjon. Funksjonene som presenteres her er tilnærmet
rekkefølgen de blir kalles inn. Funksjoner som har blitt sjekket har tags =##FUN01= etc.
* SettDefDesignKH
  En del av =globs=. Henter parametre fra tabell *KH_DELER*. Lager variabler med TYPE = ~INT~ med
  extention =*.l= og =*.h= for evt. lavest og høyest verdi. Lager en list objekt som følgende:

#+BEGIN_SRC R
  list(DelKols=DelKols, #uten deling FYLKE og GEO i GEOniv
       DelKolsF=DelKolsF, #med deling for FYLKE og GEO
       KolsDel=KolsDel, # motsatte av DelKols
       DelKolN=DelKolN, #kolonne DelKol med attribute fra DEL
       DelType=DelType, #kolonne TYPE med attribute fra DEL
       DelFormat=DelFormat, #kolonne FORMAT med attribute fra DEL
       UBeting=UBeting,
       BetingOmk=BetingOmk,
       BetingF=BetingF,
       OmkDel=OmkDel,
       DesignKols=DesignKols, #Kolonne uten TABS
       DesignKolsF=DesignKolsF, #Kolonne med TABS
       DesignKolsFA=DesignKolsFA, #Alle kolonne inkludert FYLKE og GEO
       AggPri=AggPri, #ordered DEL ift. AGGREGERPRI
       AggVedStand=AggVedStand, #velger only A og K
       IntervallHull=IntervallHull,
       AMissAllow=TRUE)
  #+END_SRC



* LagFilgruppe
Hovedfunksjon for å lese raw data og slå sammen dataene til en RDS fil.
** Argumenter
- gruppe :
- batchdate : fra *SettKHBatchDate()*
- globs : from *FinnGlobs()*
- diagnose = 0
- printR = TRUE
- printCSV = FALSE
- printSTATA = FALSE
- versjonert = FALSE
- dumps = list()
** Prosess
Beskrivelse av prosessene:
- *FinnfilgruppeParametre()* lager *FGP* object
- *FinnFilBeskGruppe()* lager *filbesk* object
- Loop alle rader i =filbesk= og lager følgende:
  + *filn* som er absolutt path til filen
  + *AAR* hvis det ikke er spesifisert eller skrevet som =<$y>= skal value hentes fra DEFAAR i ORIGINALFILER tabell
** Output

* FinnFilgruppeParametre
Setter inn parameter til en filgruppenavn. Access tabell =FILGRUPPER= brukes i denne funksjonen.
Denne produserer object *FGP* til viderebruk.
** Argumenter
- gruppe : Filgruppenavn
- batch  : fra *SettKHBatchDate()*. Denne lager dagens dato til format "%Y-%m-%d-%H-%M"
- globs  : fra *FinnGlobs()* function.
** Output
En tabell av type /list/ hentet fra tabell *FILGRUPPER*. I tillegg legges det 3 til dvs. =vals=,
=amin= og =amax=. De to siste er for alder minimum og maksium hentet fra kolonne =ALDER_ALLE=. List
=vals= i tillegg inneholder 3 tillegg lister ~$vals$verdi_i_VAL1navn~, ~$vals$verdi_i_VAL1navn$miss~ og
~$vals$verdi_i_VAL1navn$miss~. Det samme for VAL2 og VAL3. F.eks for filgruppe ARBEIDSLEDIGE så blir det:
#+begin_example
  $vals
  $vals$ARBEIDSLEDIGE
  $vals$ARBEIDSLEDIGE$miss
  [1] "0"

  $vals$ARBEIDSLEDIGE$sumbar
  [1] "1"

#+end_example
** Kommentar
- Sjekk aktiv filgruppenavn basert på tidsperiode dvs. =VERSJONFRA= og =VERSJONTIL= i Access tabell,
  men denne informasjon er ikke brukes eller oppdateres. Object =FGPaktiv=.
- Sjekk hvis det er duplikater filgruppenavn. Denne er unødvendig hvis kolonne =FILGRUPPE= er nøkkel
  eller unik i Access tabell.
- Object =amax= for maksimal aldre hentes fra Access tabel *HOVEDPARAMETREg*, men der er det bare en
  linje som lager default for maks alder. Kan dette gjøres annen sted eller er dette egentlig en ubrukt tabell?
* FinnFilBeskGruppe
Henter filnavn og path gjennom informasjon i Access tabell ORIGINALFILER, INNLESING og
ORGINNLESkobl. Denne funksjonen produserer object *delfiler* til viderebruk.
