docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="no" xml:lang="no">
<head>
<!-- 2022-07-08 fre. 14:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KHELSE function</title>
<meta name="author" content="Yusman Kamaleri" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">KHELSE function</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Innhold</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd5a1ad2">1. SettDefDesignKH</a></li>
<li><a href="#org3df7b86">2. LagFilgruppe</a>
<ul>
<li><a href="#orgb0c1ac0">2.1. Argumenter</a></li>
<li><a href="#org7e14561">2.2. Prosess</a></li>
<li><a href="#org0d42504">2.3. Output</a></li>
</ul>
</li>
<li><a href="#orga2ac8c2">3. FinnFilgruppeParametre</a>
<ul>
<li><a href="#orge211d89">3.1. Argumenter</a></li>
<li><a href="#org1138783">3.2. Output</a></li>
<li><a href="#org60f01e4">3.3. Kommentar</a></li>
</ul>
</li>
<li><a href="#orgb79afb5">4. FinnFilBeskGruppe</a>
<ul>
<li><a href="#org9915e7e">4.1. Argumenter</a></li>
<li><a href="#orgd968f0e">4.2. Output</a></li>
</ul>
</li>
<li><a href="#orgf353350">5. LagTabellFraFil</a>
<ul>
<li><a href="#orged2e69b">5.1. Argumenter</a></li>
<li><a href="#orgddcd6b8">5.2. Output</a></li>
<li><a href="#orga352948">5.3. <span class="todo TODO">TODO</span> Kommentar <code>[0/0]</code></a></li>
</ul>
</li>
<li><a href="#org70b8d00">6. LesFil</a>
<ul>
<li><a href="#orgf26a810">6.1. Argumenter</a></li>
<li><a href="#orgdee7e1b">6.2. Output</a></li>
</ul>
</li>
<li><a href="#org98eb2e9">7. FinnFilGruppeFraKoblid</a>
<ul>
<li><a href="#orgca671cc">7.1. Argumenter</a></li>
<li><a href="#org58dff47">7.2. Output</a></li>
</ul>
</li>
<li><a href="#org5b2269f">8. TilFilLogg</a>
<ul>
<li><a href="#orgd13bc9f">8.1. Argumenter</a></li>
<li><a href="#org2a9cf8d">8.2. Output:</a></li>
</ul>
</li>
<li><a href="#org3f6f320">9. KHCsvread</a>
<ul>
<li><a href="#org317ec88">9.1. Argumenter</a></li>
<li><a href="#org76f08f6">9.2. Output</a></li>
<li><a href="#org18295e1">9.3. Kommentar</a></li>
</ul>
</li>
<li><a href="#orge51ecaa">10. cSVmod</a>
<ul>
<li><a href="#org2bbada8">10.1. Argumenter</a></li>
<li><a href="#org06e20a9">10.2. Output</a></li>
<li><a href="#org8a44e7b">10.3. Kommentar</a></li>
<li><a href="#orgf8d0110">10.4. Forbedring</a></li>
</ul>
</li>
<li><a href="#org87e42e9">11. Generell spørsmål</a>
<ul>
<li><a href="#org8886ab8">11.1. Variable med <code>*.l</code> og <code>*.h</code> extention</a></li>
<li><a href="#org5310cba">11.2. Hva er <code>val.f</code> og <code>val.a</code>, og hvordan den brukes?</a></li>
<li><a href="#orgf364759">11.3. Hva kolonne TYP brukes til i GeoKoder tabell? Verdien er O og U.</a></li>
<li><a href="#org3d0db78">11.4. I Access tabell FILGRUPPER for kolonne ALDER_ALLE som har ingen data</a></li>
</ul>
</li>
<li><a href="#org2965269">12. Access related spørsmål</a>
<ul>
<li><a href="#org7b60a81">12.1. FILGRUPPER tabell</a></li>
</ul>
</li>
<li><a href="#orge268409">13. SPVflagg</a></li>
<li><a href="#org597bdd9">14. Spesialvariabler i R</a></li>
</ul>
</div>
</div>
<p>
Gjennomgang av funksjoner brukes i KHELSE funksjon. Funksjonene som presenteres her er tilnærmet
rekkefølgen de blir kalles inn. Funksjoner som har blitt sjekket har tags <code>##FUN01</code> etc.
</p>
<div id="outline-container-orgd5a1ad2" class="outline-2">
<h2 id="orgd5a1ad2"><span class="section-number-2">1.</span> SettDefDesignKH</h2>
<div class="outline-text-2" id="text-1">
<p>
En del av <code>globs</code>. Henter parametre fra tabell <b>KH_DELER</b>. Lager variabler med TYPE = <code>INT</code> med
extention <code>*.l</code> og <code>*.h</code> for evt. lavest og høyest verdi. Lager en list objekt som følgende:
</p>

<div class="org-src-container">
<pre class="src src-R">  list<span style="color: #076678;">(</span>DelKols<span style="color: #8f3f71;">=</span>DelKols, <span style="color: #a89984;">#</span><span style="color: #a89984;">uten deling FYLKE og GEO i GEOniv</span>
       DelKolsF<span style="color: #8f3f71;">=</span>DelKolsF, <span style="color: #a89984;">#</span><span style="color: #a89984;">med deling for FYLKE og GEO</span>
       KolsDel<span style="color: #8f3f71;">=</span>KolsDel, <span style="color: #a89984;"># </span><span style="color: #a89984;">motsatte av DelKols</span>
       DelKolN<span style="color: #8f3f71;">=</span>DelKolN, <span style="color: #a89984;">#</span><span style="color: #a89984;">kolonne DelKol med attribute fra DEL</span>
       DelType<span style="color: #8f3f71;">=</span>DelType, <span style="color: #a89984;">#</span><span style="color: #a89984;">kolonne TYPE med attribute fra DEL</span>
       DelFormat<span style="color: #8f3f71;">=</span>DelFormat, <span style="color: #a89984;">#</span><span style="color: #a89984;">kolonne FORMAT med attribute fra DEL</span>
       UBeting<span style="color: #8f3f71;">=</span>UBeting,
       BetingOmk<span style="color: #8f3f71;">=</span>BetingOmk,
       BetingF<span style="color: #8f3f71;">=</span>BetingF,
       OmkDel<span style="color: #8f3f71;">=</span>OmkDel,
       DesignKols<span style="color: #8f3f71;">=</span>DesignKols, <span style="color: #a89984;">#</span><span style="color: #a89984;">Kolonne uten TABS</span>
       DesignKolsF<span style="color: #8f3f71;">=</span>DesignKolsF, <span style="color: #a89984;">#</span><span style="color: #a89984;">Kolonne med TABS</span>
       DesignKolsFA<span style="color: #8f3f71;">=</span>DesignKolsFA, <span style="color: #a89984;">#</span><span style="color: #a89984;">Alle kolonne inkludert FYLKE og GEO</span>
       AggPri<span style="color: #8f3f71;">=</span>AggPri, <span style="color: #a89984;">#</span><span style="color: #a89984;">ordered DEL ift. AGGREGERPRI</span>
       AggVedStand<span style="color: #8f3f71;">=</span>AggVedStand, <span style="color: #a89984;">#</span><span style="color: #a89984;">velger only A og K</span>
       IntervallHull<span style="color: #8f3f71;">=</span>IntervallHull,
       AMissAllow<span style="color: #8f3f71;">=</span><span style="color: #8f3f71;">TRUE</span><span style="color: #076678;">)</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-org3df7b86" class="outline-2">
<h2 id="org3df7b86"><span class="section-number-2">2.</span> LagFilgruppe</h2>
<div class="outline-text-2" id="text-2">
<p>
Hovedfunksjon for å lese raw data og slå sammen dataene til en RDS fil.
</p>
</div>
<div id="outline-container-orgb0c1ac0" class="outline-3">
<h3 id="orgb0c1ac0"><span class="section-number-3">2.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>gruppe :</li>
<li>batchdate : fra <b>SettKHBatchDate()</b></li>
<li>globs : from <b>FinnGlobs()</b></li>
<li>diagnose = 0</li>
<li>printR = TRUE</li>
<li>printCSV = FALSE</li>
<li>printSTATA = FALSE</li>
<li>versjonert = FALSE</li>
<li>dumps = list()</li>
</ul>
</div>
</div>
<div id="outline-container-org7e14561" class="outline-3">
<h3 id="org7e14561"><span class="section-number-3">2.2.</span> Prosess</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Beskrivelse av prosessene:
</p>
<ul class="org-ul">
<li><b>FinnfilgruppeParametre()</b> lager <b>FGP</b> object</li>
<li><b>FinnFilBeskGruppe()</b> lager <b>filbesk</b> object</li>
<li>Loop alle rader i <code>filbesk</code> og lager følgende:
<ul class="org-ul">
<li><b>filn</b> som er absolutt path til filen</li>
<li><b>AAR</b> hvis det ikke er spesifisert eller skrevet som <code>&lt;$y&gt;</code> skal value hentes fra DEFAAR i ORIGINALFILER tabell</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0d42504" class="outline-3">
<h3 id="org0d42504"><span class="section-number-3">2.3.</span> Output</h3>
</div>
</div>

<div id="outline-container-orga2ac8c2" class="outline-2">
<h2 id="orga2ac8c2"><span class="section-number-2">3.</span> FinnFilgruppeParametre</h2>
<div class="outline-text-2" id="text-3">
<p>
Setter inn parameter til en filgruppenavn. Access tabell <code>FILGRUPPER</code> brukes i denne funksjonen.
Denne produserer object <b>FGP</b> til viderebruk.
</p>
</div>
<div id="outline-container-orge211d89" class="outline-3">
<h3 id="orge211d89"><span class="section-number-3">3.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>gruppe : Filgruppenavn</li>
<li>batch  : fra <b>SettKHBatchDate()</b>. Denne lager dagens dato til format &laquo;%Y-%m-%d-%H-%M&raquo;</li>
<li>globs  : fra <b>FinnGlobs()</b> function.</li>
</ul>
</div>
</div>
<div id="outline-container-org1138783" class="outline-3">
<h3 id="org1138783"><span class="section-number-3">3.2.</span> Output</h3>
<div class="outline-text-3" id="text-3-2">
<p>
En tabell av type <i>list</i> hentet fra tabell <b>FILGRUPPER</b>. I tillegg legges det 3 til dvs. <code>vals</code>,
<code>amin</code> og <code>amax</code>. De to siste er for alder minimum og maksium hentet fra kolonne <code>ALDER_ALLE</code>. List
<code>vals</code> i tillegg inneholder 3 tillegg lister <code>$vals$verdi_i_VAL1navn</code>, <code>$vals$verdi_i_VAL1navn$miss</code> og
<code>$vals$verdi_i_VAL1navn$miss</code>. Det samme for VAL2 og VAL3. F.eks for filgruppe ARBEIDSLEDIGE så blir det:
</p>
<pre class="example" id="org63d4d60">
  $vals
  $vals$ARBEIDSLEDIGE
  $vals$ARBEIDSLEDIGE$miss
  [1] "0"

  $vals$ARBEIDSLEDIGE$sumbar
  [1] "1"

</pre>
</div>
</div>
<div id="outline-container-org60f01e4" class="outline-3">
<h3 id="org60f01e4"><span class="section-number-3">3.3.</span> Kommentar</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Sjekk aktiv filgruppenavn basert på tidsperiode dvs. <code>VERSJONFRA</code> og <code>VERSJONTIL</code> i Access tabell,
men denne informasjon er ikke brukes eller oppdateres. Object <code>FGPaktiv</code>.</li>
<li>Sjekk hvis det er duplikater filgruppenavn. Denne er unødvendig hvis kolonne <code>FILGRUPPE</code> er nøkkel
eller unik i Access tabell.</li>
<li>Object <code>amax</code> for maksimal aldre hentes fra Access tabel <b>HOVEDPARAMETREg</b>, men der er det bare en
linje som lager default for maks alder. Kan dette gjøres annen sted eller er dette egentlig en ubrukt tabell?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb79afb5" class="outline-2">
<h2 id="orgb79afb5"><span class="section-number-2">4.</span> FinnFilBeskGruppe</h2>
<div class="outline-text-2" id="text-4">
<p>
Henter filnavn og path gjennom informasjon i Access tabell ORIGINALFILER, INNLESING og
ORGINNLESkobl. Denne funksjonen produserer object <b>delfiler</b> til viderebruk.
</p>
</div>
