docs/index.org
** Argumenter
- gruppe : filgruppenavn
- batchdate = NULL
- globs : fra =FinnGlobs()=

SQL spesifikasjonen som brukes:

 #+begin_src R
     sqlt<-paste("SELECT KOBLID, ORIGINALFILER.FILID AS FILID, FILNAVN, FORMAT, DEFAAR, INNLESING.*
                 FROM INNLESING INNER JOIN
                 (  ORGINNLESkobl INNER JOIN ORIGINALFILER
                 ON ORGINNLESkobl.FILID = ORIGINALFILER.FILID)
                 ON   (INNLESING.DELID = ORGINNLESkobl.DELID)
                 AND (INNLESING.FILGRUPPE = ORGINNLESkobl.FILGRUPPE)
                 WHERE INNLESING.FILGRUPPE='",filgruppe,"'
                 AND ORIGINALFILER.IBRUKFRA<=",datef,"
                 AND ORIGINALFILER.IBRUKTIL>", datef,"
                 AND INNLESING.VERSJONFRA<=",datef,"
                 AND INNLESING.VERSJONTIL>",datef,sep="")
 #+end_src

Disse variabler er laget av denne funksjonen:

#+BEGIN_SRC R
  > names(fb)
   [1] "KOBLID"      "FILID"       "FILNAVN"     "FORMAT"      "DEFAAR"
   [6] "ID"          "FILGRUPPE"   "DELID"       "BRUK"        "VERSJONFRA"
  [11] "VERSJONTIL"  "FORMATgml"   "INNLESARG"   "MANHEADER"   "MULTIHEAD"
  [16] "KASTKOLS"    "UNDERTABLOK" "FYLLTAB"     "RESHAPEid"   "RESHAPEmeas"
  [21] "RESHAPEvar"  "RESHAPEval"  "AGGERGER_DF" "RSYNT1"      "RSYNT2"
  [26] "FEILRAPPORT" "GEO"         "GEOd2"       "GRUNNKRETS"  "TKNR"
  [31] "SONER"       "AAR"         "KJONN"       "ALDER"       "UTDANN"
  [36] "SIVST"       "LANDBAK"     "TAB1"        "TAB2"        "TAB3"
  [41] "VAL1"        "VAL2"        "VAL3"        "ALDERkb"     "KJONNkb"
  [46] "TAB1kb"      "TAB2kb"      "TAB3kb"      "KOMMENTAR"   "RAPPORT2"
  [51] "TID"         "PROSESSDATO" "SKALA_VAL1"  "SKALA_VAL2"  "SKALA_VAL3"
#+END_SRC
** Output
* LagTabellFraFil
** Argumenter
- filbesk : Object fra =FinnFilBeskGruppe()= function
- FGP : Object fra =FinnFilgruppeParametre()= function
- diagnose = diagnose
- globs = globs
- versjonert = versjonert
- dumps = dumps
** Output
** TODO Kommenter [0/0]
   [ ] Hva skal kolonne *FYLLTAB* brukkes for?
   [ ] Hvor finner man kolonner *RESHAPEpre* og *RESHAPEpost*?
   [ ] Hva er *GEOd2*?
* LesFil
Innkalt under *LagTabellFraFil()* function
** Argumenter
- filbesk
- batchdate = batcdate
- globs = globs
- dumps = dumps
** Output
* FinnFilGruppeFraKoblid
Valg filgruppenavn i kolonne FILGRUPPE som match =filbesk$KOBLID= fra tabell *ORGINNLESkobl*. Innkalles under
*LesFil()* i sqlQuery for INSERT i SQL kode med argument =filbesk$KOBLID=.
** Argumenter
 - koblid : verdi fra object filbesk$KOBLID
 - globs  : fra function *FinnGlobs()*

** Output
En vector av den filgruppenavn til den spesifisert KOBLID eg. =UFORE=.
* TilFilLogg
_OBS!_: Denne funksjonen ender opp med CRASH nokså ofte! Innkalles under *LesFil()* for å leser
Access tabell *INNLES_LOGG* basert på KOBLID og objekt =batchdate=.
** Argumenter
 - koblid :
 - felt :
 - verdi :
 - batchdate : from *SettKHBatchDate()* function
 - globs : fra *FinnGlobs()*

Query som brukes bl.a

#+BEGIN_SRC R
  sqlQuery(globs$log,paste("DELETE * FROM INNLES_LOGG WHERE KOBLID=",koblid,"AND SV='S'",sep=""))

  upd<-paste("INSERT INTO INNLES_LOGG ( KOBLID, BATCH, SV, FILGRUPPE ) SELECT=",koblid,",'",batchdate,"', 'S',",FinnFilGruppeFraKoblid(koblid),sep="")
      sqlQuery(globs$log,upd)

  upd<-paste("UPDATE INNLES_LOGG SET ",felt,"=",verdi," WHERE KOBLID=",koblid," AND SV='S' AND BATCH='",batchdate,"'",sep="")
#+END_SRC

** Output:
Legger til ny rad i INNLES_LOGG tabell via INSERT eller oppdatere tabellen via UPDATE.
