docs/index.html
<div id="outline-container-org9915e7e" class="outline-3">
<h3 id="org9915e7e"><span class="section-number-3">4.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>gruppe : filgruppenavn</li>
<li>batchdate = NULL</li>
<li>globs : fra <code>FinnGlobs()</code></li>
</ul>

<p>
SQL spesifikasjonen som brukes:
</p>

<div class="org-src-container">
<pre class="src src-R">     sqlt<span style="color: #8f3f71;">&lt;-</span>paste<span style="color: #076678;">(</span><span style="color: #79740e;">"SELECT KOBLID, ORIGINALFILER.FILID AS FILID, FILNAVN, FORMAT, DEFAAR, INNLESING.*</span>
<span style="color: #79740e;">                 FROM INNLESING INNER JOIN</span>
<span style="color: #79740e;">                 (  ORGINNLESkobl INNER JOIN ORIGINALFILER</span>
<span style="color: #79740e;">                 ON ORGINNLESkobl.FILID = ORIGINALFILER.FILID)</span>
<span style="color: #79740e;">                 ON   (INNLESING.DELID = ORGINNLESkobl.DELID)</span>
<span style="color: #79740e;">                 AND (INNLESING.FILGRUPPE = ORGINNLESkobl.FILGRUPPE)</span>
<span style="color: #79740e;">                 WHERE INNLESING.FILGRUPPE='"</span>,filgruppe,<span style="color: #79740e;">"'</span>
<span style="color: #79740e;">                 AND ORIGINALFILER.IBRUKFRA&lt;="</span>,datef,<span style="color: #79740e;">"</span>
<span style="color: #79740e;">                 AND ORIGINALFILER.IBRUKTIL&gt;"</span>, datef,<span style="color: #79740e;">"</span>
<span style="color: #79740e;">                 AND INNLESING.VERSJONFRA&lt;="</span>,datef,<span style="color: #79740e;">"</span>
<span style="color: #79740e;">                 AND INNLESING.VERSJONTIL&gt;"</span>,datef,sep<span style="color: #8f3f71;">=</span><span style="color: #79740e;">""</span><span style="color: #076678;">)</span>
</pre>
</div>

<p>
Disse variabler er laget av denne funksjonen:
</p>

<div class="org-src-container">
<pre class="src src-R">  <span style="color: #8f3f71;">&gt;</span> names<span style="color: #076678;">(</span>fb<span style="color: #076678;">)</span>
   <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">1</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"KOBLID"</span>      <span style="color: #79740e;">"FILID"</span>       <span style="color: #79740e;">"FILNAVN"</span>     <span style="color: #79740e;">"FORMAT"</span>      <span style="color: #79740e;">"DEFAAR"</span>
   <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">6</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"ID"</span>          <span style="color: #79740e;">"FILGRUPPE"</span>   <span style="color: #79740e;">"DELID"</span>       <span style="color: #79740e;">"BRUK"</span>        <span style="color: #79740e;">"VERSJONFRA"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">11</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"VERSJONTIL"</span>  <span style="color: #79740e;">"FORMATgml"</span>   <span style="color: #79740e;">"INNLESARG"</span>   <span style="color: #79740e;">"MANHEADER"</span>   <span style="color: #79740e;">"MULTIHEAD"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">16</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"KASTKOLS"</span>    <span style="color: #79740e;">"UNDERTABLOK"</span> <span style="color: #79740e;">"FYLLTAB"</span>     <span style="color: #79740e;">"RESHAPEid"</span>   <span style="color: #79740e;">"RESHAPEmeas"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">21</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"RESHAPEvar"</span>  <span style="color: #79740e;">"RESHAPEval"</span>  <span style="color: #79740e;">"AGGERGER_DF"</span> <span style="color: #79740e;">"RSYNT1"</span>      <span style="color: #79740e;">"RSYNT2"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">26</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"FEILRAPPORT"</span> <span style="color: #79740e;">"GEO"</span>         <span style="color: #79740e;">"GEOd2"</span>       <span style="color: #79740e;">"GRUNNKRETS"</span>  <span style="color: #79740e;">"TKNR"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">31</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"SONER"</span>       <span style="color: #79740e;">"AAR"</span>         <span style="color: #79740e;">"KJONN"</span>       <span style="color: #79740e;">"ALDER"</span>       <span style="color: #79740e;">"UTDANN"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">36</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"SIVST"</span>       <span style="color: #79740e;">"LANDBAK"</span>     <span style="color: #79740e;">"TAB1"</span>        <span style="color: #79740e;">"TAB2"</span>        <span style="color: #79740e;">"TAB3"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">41</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"VAL1"</span>        <span style="color: #79740e;">"VAL2"</span>        <span style="color: #79740e;">"VAL3"</span>        <span style="color: #79740e;">"ALDERkb"</span>     <span style="color: #79740e;">"KJONNkb"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">46</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"TAB1kb"</span>      <span style="color: #79740e;">"TAB2kb"</span>      <span style="color: #79740e;">"TAB3kb"</span>      <span style="color: #79740e;">"KOMMENTAR"</span>   <span style="color: #79740e;">"RAPPORT2"</span>
  <span style="color: #076678;">[</span><span style="color: #8f3f71; font-weight: bold;">51</span><span style="color: #076678;">]</span> <span style="color: #79740e;">"TID"</span>         <span style="color: #79740e;">"PROSESSDATO"</span> <span style="color: #79740e;">"SKALA_VAL1"</span>  <span style="color: #79740e;">"SKALA_VAL2"</span>  <span style="color: #79740e;">"SKALA_VAL3"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd968f0e" class="outline-3">
<h3 id="orgd968f0e"><span class="section-number-3">4.2.</span> Output</h3>
</div>
</div>
<div id="outline-container-orgf353350" class="outline-2">
<h2 id="orgf353350"><span class="section-number-2">5.</span> LagTabellFraFil</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orged2e69b" class="outline-3">
<h3 id="orged2e69b"><span class="section-number-3">5.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>filbesk : Object fra <code>FinnFilBeskGruppe()</code> function</li>
<li>FGP : Object fra <code>FinnFilgruppeParametre()</code> function</li>
<li>diagnose = diagnose</li>
<li>globs = globs</li>
<li>versjonert = versjonert</li>
<li>dumps = dumps</li>
</ul>
</div>
</div>
<div id="outline-container-orgddcd6b8" class="outline-3">
<h3 id="orgddcd6b8"><span class="section-number-3">5.2.</span> Output</h3>
</div>
<div id="outline-container-orga352948" class="outline-3">
<h3 id="orga352948"><span class="section-number-3">5.3.</span> <span class="todo TODO">TODO</span> Kommentar <code>[0/0]</code></h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Hva skal kolonne <b>FYLLTAB</b> brukkes for?</li>
<li class="off"><code>[&#xa0;]</code> Hvor finner man kolonner <b>RESHAPEpre</b> og <b>RESHAPEpost</b>?</li>
<li class="off"><code>[&#xa0;]</code> Hva er <b>GEOd2</b>?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org70b8d00" class="outline-2">
<h2 id="org70b8d00"><span class="section-number-2">6.</span> LesFil</h2>
<div class="outline-text-2" id="text-6">
<p>
Innkalt under <b>LagTabellFraFil()</b> function
</p>
</div>
<div id="outline-container-orgf26a810" class="outline-3">
<h3 id="orgf26a810"><span class="section-number-3">6.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>filbesk</li>
<li>batchdate = batcdate</li>
<li>globs = globs</li>
<li>dumps = dumps</li>
</ul>
</div>
</div>
<div id="outline-container-orgdee7e1b" class="outline-3">
<h3 id="orgdee7e1b"><span class="section-number-3">6.2.</span> Output</h3>
</div>
</div>
<div id="outline-container-org98eb2e9" class="outline-2">
<h2 id="org98eb2e9"><span class="section-number-2">7.</span> FinnFilGruppeFraKoblid</h2>
<div class="outline-text-2" id="text-7">
<p>
Valg filgruppenavn i kolonne FILGRUPPE som match <code>filbesk$KOBLID</code> fra tabell <b>ORGINNLESkobl</b>. Innkalles under
<b>LesFil()</b> i sqlQuery for INSERT i SQL kode med argument <code>filbesk$KOBLID</code>.
</p>
</div>
<div id="outline-container-orgca671cc" class="outline-3">
<h3 id="orgca671cc"><span class="section-number-3">7.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>koblid : verdi fra object filbesk$KOBLID</li>
<li>globs  : fra function <b>FinnGlobs()</b></li>
</ul>
</div>
</div>

<div id="outline-container-org58dff47" class="outline-3">
<h3 id="org58dff47"><span class="section-number-3">7.2.</span> Output</h3>
<div class="outline-text-3" id="text-7-2">
<p>
En vector av den filgruppenavn til den spesifisert KOBLID eg. <code>UFORE</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org5b2269f" class="outline-2">
<h2 id="org5b2269f"><span class="section-number-2">8.</span> TilFilLogg</h2>
<div class="outline-text-2" id="text-8">
<p>
<span class="underline">OBS!</span>: Denne funksjonen ender opp med CRASH nokså ofte! Innkalles under <b>LesFil()</b> for å leser
Access tabell <b>INNLES_LOGG</b> basert på KOBLID og objekt <code>batchdate</code>.
</p>
</div>
<div id="outline-container-orgd13bc9f" class="outline-3">
<h3 id="orgd13bc9f"><span class="section-number-3">8.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>koblid :</li>
<li>felt :</li>
<li>verdi :</li>
<li>batchdate : from <b>SettKHBatchDate()</b> function</li>
<li>globs : fra <b>FinnGlobs()</b></li>
</ul>

<p>
Query som brukes bl.a
</p>

<div class="org-src-container">
<pre class="src src-R">  sqlQuery<span style="color: #076678;">(</span>globs$log,paste<span style="color: #b16286;">(</span><span style="color: #79740e;">"DELETE * FROM INNLES_LOGG WHERE KOBLID="</span>,koblid,<span style="color: #79740e;">"AND SV='S'"</span>,sep<span style="color: #8f3f71;">=</span><span style="color: #79740e;">""</span><span style="color: #b16286;">)</span><span style="color: #076678;">)</span>

  upd<span style="color: #8f3f71;">&lt;-</span>paste<span style="color: #076678;">(</span><span style="color: #79740e;">"INSERT INTO INNLES_LOGG ( KOBLID, BATCH, SV, FILGRUPPE ) SELECT="</span>,koblid,<span style="color: #79740e;">",'"</span>,batchdate,<span style="color: #79740e;">"', 'S',"</span>,FinnFilGruppeFraKoblid<span style="color: #b16286;">(</span>koblid<span style="color: #b16286;">)</span>,sep<span style="color: #8f3f71;">=</span><span style="color: #79740e;">""</span><span style="color: #076678;">)</span>
      sqlQuery<span style="color: #076678;">(</span>globs$log,upd<span style="color: #076678;">)</span>

  upd<span style="color: #8f3f71;">&lt;-</span>paste<span style="color: #076678;">(</span><span style="color: #79740e;">"UPDATE INNLES_LOGG SET "</span>,felt,<span style="color: #79740e;">"="</span>,verdi,<span style="color: #79740e;">" WHERE KOBLID="</span>,koblid,<span style="color: #79740e;">" AND SV='S' AND BATCH='"</span>,batchdate,<span style="color: #79740e;">"'"</span>,sep<span style="color: #8f3f71;">=</span><span style="color: #79740e;">""</span><span style="color: #076678;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a9cf8d" class="outline-3">
<h3 id="org2a9cf8d"><span class="section-number-3">8.2.</span> Output:</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Legger til ny rad i INNLES_LOGG tabell via INSERT eller oppdatere tabellen via UPDATE.
</p>
</div>
</div>
</div>
