docs/index.org
* KHCsvread
Leser inn CSV filer ved bruk =read.csv= eller =data.table::fread=.
** Argumenter
 - filn : Absolutt sti til filen
 - header = FALSE
 - skip = 0
 - calClasses = "character"
 - sep = ";"
 - quote = "\"" _obs!_ denne bør være '\"'
 - dec = "."
 - fill = FALSE
 - encoding = "unknown"
 - blank.lines.skip = FALSE
 - na.strings = c("NA")
 - brukfread = TRUE
 - ...
** Output
En csv fil med header=FALSE dvs. header i tabellen blir til en ny kolonne. Hvorfor??
** Kommentar
Koden for å lese csv med =fread= som produserer =data.frame= kan skrives slik:

#+BEGIN_SRC R
  fread(DT, data.table = FALSE)
#+END_SRC
* cSVmod
Restrukturerer dataene ved bruk parametrer fra INNLESING tabell.
** Argumenter
 - DF : data.frame i CSV format fra KHCsvread eller XLS
 - filbesk :
 - header = TRUE
 - skip = 0
   Hvilke rader som skal uttelates ved lesing
 - slettRader = integer(0)
   *obs!* her bør det være =0L=. Denne skal velger rader som skal slettes.
 - sisteRad = 1
   Velges hvilken som er siste rader
 - TomRadSlutt = FALSE Velge hvilken rader som er tommer og subsett data.frame fra rad 1 til raden
   som den tomme raden.
 - FjernTommeRader = FALSE
   Slett tomme rader i hele data.frame
 - FjernTommeKol = TRUE
   Slett tomme kolonne
 - globs = FinnGlobs()
 - ...
** Output

** Kommentar
   Flere argumenter som egentlig gjør nesten det samme oppgavene. Alternativ å finne tomme rader
   eller kolonne kan brukes =apply= og er nok raskere.

  #+BEGIN_SRC R
    rnames <- rownames(DF[apply(is.na(DF) | DF == "", 1, all), ]) #for rader
    knames <- rownames(DF[apply(is.na(DF) | DF == "", 2, all), ]) #for kolonner

    which(rownames(DF) %in% tnames)
  #+END_SRC
** Forbedring
   - Finne ut i INNLESSING tabell hvor mange som har =FjernTommeRader= og =FjernTommeKol=. Sjekk
   hvordan filen ser ut og tilpasse deretter før ny database lages.

* Generell spørsmål
  Alle type spørsmål som trenger oppklaring:
** Variable med =*.l= og =*.h= extention
   Alle år og aldre er ALLTID intervaller i hele systemet. Dermed brukes alltid AARl/AARh og
   ALDERl/ALDERh. Dette gjelder selv om det bare dreire seg om enkelte kalenderår (AARl=2020,
   AARh=2020) eller enkle aldersår (ALDERl=30,ALDERh=30).
** Hva er =val.f= og =val.a=, og hvordan den brukes?
   =val.a= og =val.f= er to flagg som alltid går hånd i hånd med hver verdikolonne. Detaljene kan
   våre ganske kompliserte, men i hovedtrekk:

   ~val.a~ teller opp hvor mange originaltall som har vårt brukt til å lage verdien. Eksempler:
   Når to kommuner slås sammen for kommuneharmonisering blir det typisk ~val.a=2~. Når tall for
   5 enkeltaldre slås sammen til en 5 års aldersgruppe blir det ~val.a=5~. De to tilfellen i
   kombinasjon gir ~val.a=10~

   =val.f= er strengt tatt viktigere. Den angir i hovedtrekk hvorfor tall er NA. Er det fordi tallet
   mangler originalt, er det fordi det ikke lar seg bergene, er det fordi det anonymisres osv.

   Men begge =val.a= og =val.f= får statis ferdi henholdsvis 0 og 1. Se [[https://github.com/helseprofil/khfunctions/blob/master/KHfunctions.R#L986][koden]].

#+BEGIN_SRC R :eval FALSE 
  valok<-1
  valf<-paste(val,".f",sep="")
  vala<-paste(val,".a",sep="")
  valomk<-paste(val,"omk",sep="")

  ##Lag omkodet verdi med numerisk. Ikke numerisk blir foreløpig NA
  suppressWarnings(DF[,valomk]<-as.numeric(valKB$omk))
  DF[,valf]<-0
  DF[,vala]<-1
  DF[valKB$omk==".." & DF[,val]!=valKB$omk,valf]<-1
  DF[valKB$omk=="." & DF[,val]!=valKB$omk,valf]<-2
  DF[valKB$omk==":" & DF[,val]!=valKB$omk,valf]<-3
   #+END_SRC

** Hva kolonne TYP brukes til i GeoKoder tabell? Verdien er O og U.
   TYP=0 er de Ordinåre geokodene, TYP=U er geokoder som angir "Uoppgitt" (slik som at 1199 er
   uopgitt kommune under fylket 11). Dette filteret brukes når det produseres kuber og
   Firksvik-data, da blir det ikke rapportert tall for U-koder, men disse må våre med fram til da
   fordi de inngår i summer som lager totaler for høyere geografisk nivå (1199 tall inngår
   i 11 osv).

** I Access tabell FILGRUPPER for kolonne ALDER_ALLE som har ingen data
   Noen ganger skreves det som =NA= eller =25_=. Når det er =NA= så plukket verdier fra default ie.
   min og maks alder. Når det er bare =25_= så legges maks alder fra tabell ..
