docs/index.html
<div id="outline-container-org3f6f320" class="outline-2">
<h2 id="org3f6f320"><span class="section-number-2">9.</span> KHCsvread</h2>
<div class="outline-text-2" id="text-9">
<p>
Leser inn CSV filer ved bruk <code>read.csv</code> eller <code>data.table::fread</code>.
</p>
</div>
<div id="outline-container-org317ec88" class="outline-3">
<h3 id="org317ec88"><span class="section-number-3">9.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>filn : Absolutt sti til filen</li>
<li>header = FALSE</li>
<li>skip = 0</li>
<li>calClasses = &laquo;character&raquo;</li>
<li>sep = &laquo;;&raquo;</li>
<li>quote = &laquo;\&raquo;&laquo; <span class="underline">obs!</span> denne bør være &lsquo;\&raquo;&rsquo;</li>
<li>dec = &laquo;.&raquo;</li>
<li>fill = FALSE</li>
<li>encoding = &laquo;unknown&raquo;</li>
<li>blank.lines.skip = FALSE</li>
<li>na.strings = c(&laquo;NA&raquo;)</li>
<li>brukfread = TRUE</li>
<li>&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org76f08f6" class="outline-3">
<h3 id="org76f08f6"><span class="section-number-3">9.2.</span> Output</h3>
<div class="outline-text-3" id="text-9-2">
<p>
En csv fil med header=FALSE dvs. header i tabellen blir til en ny kolonne. Hvorfor??
</p>
</div>
</div>
<div id="outline-container-org18295e1" class="outline-3">
<h3 id="org18295e1"><span class="section-number-3">9.3.</span> Kommentar</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Koden for å lese csv med <code>fread</code> som produserer <code>data.frame</code> kan skrives slik:
</p>

<div class="org-src-container">
<pre class="src src-R">  fread<span style="color: #076678;">(</span>DT, data.table <span style="color: #8f3f71;">=</span> <span style="color: #8f3f71;">FALSE</span><span style="color: #076678;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge51ecaa" class="outline-2">
<h2 id="orge51ecaa"><span class="section-number-2">10.</span> cSVmod</h2>
<div class="outline-text-2" id="text-10">
<p>
Restrukturerer dataene ved bruk parametrer fra INNLESING tabell.
</p>
</div>
<div id="outline-container-org2bbada8" class="outline-3">
<h3 id="org2bbada8"><span class="section-number-3">10.1.</span> Argumenter</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>DF : data.frame i CSV format fra KHCsvread eller XLS</li>
<li>filbesk :</li>
<li>header = TRUE</li>
<li>skip = 0
Hvilke rader som skal uttelates ved lesing</li>
<li>slettRader = integer(0)
<b>obs!</b> her bør det være <code>0L</code>. Denne skal velger rader som skal slettes.</li>
<li>sisteRad = 1
Velges hvilken som er siste rader</li>
<li>TomRadSlutt = FALSE Velge hvilken rader som er tommer og subsett data.frame fra rad 1 til raden
som den tomme raden.</li>
<li>FjernTommeRader = FALSE
Slett tomme rader i hele data.frame</li>
<li>FjernTommeKol = TRUE
Slett tomme kolonne</li>
<li>globs = FinnGlobs()</li>
<li>&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org06e20a9" class="outline-3">
<h3 id="org06e20a9"><span class="section-number-3">10.2.</span> Output</h3>
</div>

<div id="outline-container-org8a44e7b" class="outline-3">
<h3 id="org8a44e7b"><span class="section-number-3">10.3.</span> Kommentar</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Flere argumenter som egentlig gjør nesten det samme oppgavene. Alternativ å finne tomme rader
eller kolonne kan brukes <code>apply</code> og er nok raskere.
</p>

<div class="org-src-container">
<pre class="src src-R">    rnames <span style="color: #8f3f71;">&lt;-</span> rownames<span style="color: #076678;">(</span>DF<span style="color: #b16286;">[</span>apply<span style="color: #8ec07c;">(</span>is.na<span style="color: #d65d0e;">(</span>DF<span style="color: #d65d0e;">)</span> <span style="color: #8f3f71;">|</span> DF <span style="color: #8f3f71;">==</span> <span style="color: #79740e;">""</span>, <span style="color: #8f3f71; font-weight: bold;">1</span>, all<span style="color: #8ec07c;">)</span>, <span style="color: #b16286;">]</span><span style="color: #076678;">)</span> <span style="color: #a89984;">#</span><span style="color: #a89984;">for rader</span>
    knames <span style="color: #8f3f71;">&lt;-</span> rownames<span style="color: #076678;">(</span>DF<span style="color: #b16286;">[</span>apply<span style="color: #8ec07c;">(</span>is.na<span style="color: #d65d0e;">(</span>DF<span style="color: #d65d0e;">)</span> <span style="color: #8f3f71;">|</span> DF <span style="color: #8f3f71;">==</span> <span style="color: #79740e;">""</span>, <span style="color: #8f3f71; font-weight: bold;">2</span>, all<span style="color: #8ec07c;">)</span>, <span style="color: #b16286;">]</span><span style="color: #076678;">)</span> <span style="color: #a89984;">#</span><span style="color: #a89984;">for kolonner</span>

    which<span style="color: #076678;">(</span>rownames<span style="color: #b16286;">(</span>DF<span style="color: #b16286;">)</span> <span style="color: #8f3f71;">%in%</span> tnames<span style="color: #076678;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf8d0110" class="outline-3">
<h3 id="orgf8d0110"><span class="section-number-3">10.4.</span> Forbedring</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li>Finne ut i INNLESSING tabell hvor mange som har <code>FjernTommeRader</code> og <code>FjernTommeKol</code>. Sjekk</li>
</ul>
<p>
hvordan filen ser ut og tilpasse deretter før ny database lages.
</p>
</div>
</div>
</div>

<div id="outline-container-org87e42e9" class="outline-2">
<h2 id="org87e42e9"><span class="section-number-2">11.</span> Generell spørsmål</h2>
<div class="outline-text-2" id="text-11">
<p>
Alle type spørsmål som trenger oppklaring:
</p>
</div>
<div id="outline-container-org8886ab8" class="outline-3">
<h3 id="org8886ab8"><span class="section-number-3">11.1.</span> Variable med <code>*.l</code> og <code>*.h</code> extention</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Alle år og aldre er ALLTID intervaller i hele systemet. Dermed brukes alltid AARl/AARh og
ALDERl/ALDERh. Dette gjelder selv om det bare dreire seg om enkelte kalenderår (AARl=2020,
AARh=2020) eller enkle aldersår (ALDERl=30,ALDERh=30).
</p>
</div>
</div>
<div id="outline-container-org5310cba" class="outline-3">
<h3 id="org5310cba"><span class="section-number-3">11.2.</span> Hva er <code>val.f</code> og <code>val.a</code>, og hvordan den brukes?</h3>
<div class="outline-text-3" id="text-11-2">
<p>
<code>val.a</code> og <code>val.f</code> er to flagg som alltid går hånd i hånd med hver verdikolonne. Detaljene kan
våre ganske kompliserte, men i hovedtrekk:
</p>

<p>
<code>val.a</code> teller opp hvor mange originaltall som har vårt brukt til å lage verdien. Eksempler:
Når to kommuner slås sammen for kommuneharmonisering blir det typisk <code>val.a=2</code>. Når tall for
5 enkeltaldre slås sammen til en 5 års aldersgruppe blir det <code>val.a=5</code>. De to tilfellen i
kombinasjon gir <code>val.a=10</code>
</p>

<p>
<code>val.f</code> er strengt tatt viktigere. Den angir i hovedtrekk hvorfor tall er NA. Er det fordi tallet
mangler originalt, er det fordi det ikke lar seg bergene, er det fordi det anonymisres osv.
</p>

<p>
Men begge <code>val.a</code> og <code>val.f</code> får statis ferdi henholdsvis 0 og 1. Se <a href="https://github.com/helseprofil/khfunctions/blob/master/KHfunctions.R#L986">koden</a>.
</p>

<div class="org-src-container">
<pre class="src src-R">  valok<span style="color: #8f3f71;">&lt;-</span><span style="color: #8f3f71; font-weight: bold;">1</span>
  valf<span style="color: #8f3f71;">&lt;-</span>paste<span style="color: #076678;">(</span>val,<span style="color: #79740e;">".f"</span>,sep<span style="color: #8f3f71;">=</span><span style="color: #79740e;">""</span><span style="color: #076678;">)</span>
  vala<span style="color: #8f3f71;">&lt;-</span>paste<span style="color: #076678;">(</span>val,<span style="color: #79740e;">".a"</span>,sep<span style="color: #8f3f71;">=</span><span style="color: #79740e;">""</span><span style="color: #076678;">)</span>
  valomk<span style="color: #8f3f71;">&lt;-</span>paste<span style="color: #076678;">(</span>val,<span style="color: #79740e;">"omk"</span>,sep<span style="color: #8f3f71;">=</span><span style="color: #79740e;">""</span><span style="color: #076678;">)</span>

  <span style="color: #a89984;">##</span><span style="color: #a89984;">Lag omkodet verdi med numerisk. Ikke numerisk blir forel&#248;pig NA</span>
  suppressWarnings<span style="color: #076678;">(</span>DF<span style="color: #b16286;">[</span>,valomk<span style="color: #b16286;">]</span><span style="color: #8f3f71;">&lt;-</span>as.numeric<span style="color: #b16286;">(</span>valKB$omk<span style="color: #b16286;">)</span><span style="color: #076678;">)</span>
  DF<span style="color: #076678;">[</span>,valf<span style="color: #076678;">]</span><span style="color: #8f3f71;">&lt;-</span><span style="color: #8f3f71; font-weight: bold;">0</span>
  DF<span style="color: #076678;">[</span>,vala<span style="color: #076678;">]</span><span style="color: #8f3f71;">&lt;-</span><span style="color: #8f3f71; font-weight: bold;">1</span>
  DF<span style="color: #076678;">[</span>valKB$omk<span style="color: #8f3f71;">==</span><span style="color: #79740e;">".."</span> <span style="color: #8f3f71;">&amp;</span> DF<span style="color: #b16286;">[</span>,val<span style="color: #b16286;">]</span>!<span style="color: #8f3f71;">=</span>valKB$omk,valf<span style="color: #076678;">]</span><span style="color: #8f3f71;">&lt;-</span><span style="color: #8f3f71; font-weight: bold;">1</span>
  DF<span style="color: #076678;">[</span>valKB$omk<span style="color: #8f3f71;">==</span><span style="color: #79740e;">"."</span> <span style="color: #8f3f71;">&amp;</span> DF<span style="color: #b16286;">[</span>,val<span style="color: #b16286;">]</span>!<span style="color: #8f3f71;">=</span>valKB$omk,valf<span style="color: #076678;">]</span><span style="color: #8f3f71;">&lt;-</span><span style="color: #8f3f71; font-weight: bold;">2</span>
  DF<span style="color: #076678;">[</span>valKB$omk<span style="color: #8f3f71;">==</span><span style="color: #79740e;">":"</span> <span style="color: #8f3f71;">&amp;</span> DF<span style="color: #b16286;">[</span>,val<span style="color: #b16286;">]</span>!<span style="color: #8f3f71;">=</span>valKB$omk,valf<span style="color: #076678;">]</span><span style="color: #8f3f71;">&lt;-</span><span style="color: #8f3f71; font-weight: bold;">3</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf364759" class="outline-3">
<h3 id="orgf364759"><span class="section-number-3">11.3.</span> Hva kolonne TYP brukes til i GeoKoder tabell? Verdien er O og U.</h3>
<div class="outline-text-3" id="text-11-3">
<p>
TYP=0 er de Ordinåre geokodene, TYP=U er geokoder som angir &laquo;Uoppgitt&raquo; (slik som at 1199 er
uopgitt kommune under fylket 11). Dette filteret brukes når det produseres kuber og
Firksvik-data, da blir det ikke rapportert tall for U-koder, men disse må våre med fram til da
fordi de inngår i summer som lager totaler for høyere geografisk nivå (1199 tall inngår
i 11 osv).
</p>
</div>
</div>

<div id="outline-container-org3d0db78" class="outline-3">
<h3 id="org3d0db78"><span class="section-number-3">11.4.</span> I Access tabell FILGRUPPER for kolonne ALDER_ALLE som har ingen data</h3>
<div class="outline-text-3" id="text-11-4">
<p>
Noen ganger skreves det som <code>NA</code> eller <code>25_</code>. Når det er <code>NA</code> så plukket verdier fra default ie.
min og maks alder. Når det er bare <code>25_</code> så legges maks alder fra tabell ..
</p>
</div>
</div>
</div>
