docs/index.html
<div id="outline-container-org2965269" class="outline-2">
<h2 id="org2965269"><span class="section-number-2">12.</span> Access related spørsmål</h2>
<div class="outline-text-2" id="text-12">
<p>
Dette er spørsmål spesifisert til kolonnebruk i Access tabeller.
</p>
</div>
<div id="outline-container-org7b60a81" class="outline-3">
<h3 id="org7b60a81"><span class="section-number-3">12.1.</span> FILGRUPPER tabell</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>Hva kolonne <b>FILTER1</b>, <b>FILTER2</b> og <b>FILTER3</b> brukes til? Verdien er <code>1</code>.</li>
<li>Kolonne <b>ALDER_ALLE</b> har forskjellige verdier bl.a <code>0_120</code>, <code>1_6</code>, <code>25_</code> og ingen verdi? Når
ingen verdi blir det satt 0_120 som min og maks alder. Når det skreves bare <code>25_</code> skal det får
25 som min alder og 120 som maks alder.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge268409" class="outline-2">
<h2 id="orge268409"><span class="section-number-2">13.</span> SPVflagg</h2>
<div class="outline-text-2" id="text-13">
<p>
Disse gjelder når dataene er kjørt i <code>LagKUBE</code>. Notat er fra Steinar.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Kode i data</th>
<th scope="col" class="org-left">Tegn i KH/NH tabell</th>
<th scope="col" class="org-left">Tekst i fotnote</th>
<th scope="col" class="org-left">Tekst i SSB Statbank fotnote</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">ingen</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">..</td>
<td class="org-left">Manglende data</td>
<td class="org-left">Tallgrunnlag mangler dvs. tall er ikke kommet inn i våre databaser eller er for usikre til å publiseres</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">.</td>
<td class="org-left">Lar seg ikke beregne</td>
<td class="org-left">Ikke mulig å oppgi tall dvs. tall finnes ikke på dette tidspunktet fordi kategorien ikke var i bruk da tallene ble samlet inn</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">:</td>
<td class="org-left">Anonymisert</td>
<td class="org-left">Vises ikke av konfidensialitetshensyn dvs. tall publiseres ikke for å unngå å identifisere personer eller virksomheter</td>
</tr>
</tbody>
</table>


<p>
Kodene settes i gamleløypa (KHfunctions.R, i kubeproduksjonstrinnet) i variabler
med navn &lt;måtall&gt;.f . Det er flere koder i bruk inne i databehandlingen, fordi
ulike årsaker til at det mangler tall må behandles ulikt ved aggregering,
prikking og skjuling. Helt til slutt i LagKUBE oversettes de interne kodene til
en av de tre vist ovenfor.
</p>

<p>
Den koden som kommer ut i kuben, ser ikke alltid logisk ut. I flere tilfeller
har vi skrevet postprosesseringsscript som har &laquo;ryddet opp&raquo; i kodene, når vi vet
at det er spesielle årsaker til at større grupper i dataene (for eksempel
bydelene i noen byer) har manglende tall.
</p>
</div>
</div>
<div id="outline-container-org597bdd9" class="outline-2">
<h2 id="org597bdd9"><span class="section-number-2">14.</span> Spesialvariabler i R</h2>
<div class="outline-text-2" id="text-14">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">..a</td>
<td class="org-left">Antall rader tallet stammer fra (Kommunesammenslåinger!,  M+K -&gt; Kjønn samlet, o.l.)</td>
</tr>

<tr>
<td class="org-left">..f</td>
<td class="org-left">Flagg, blir til SPVflagg etter et sett regler. Det er ett slikt flagg for hver tallvariabel, men de samles til en verdi i SPVflagg. Reglene er bl.a. :</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- Verdier 1-2-3 blir til det samme i SPVflagg. Kan altså sette disse direkte, hvis de skal rettes.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- Verdier -1 og 4 blir til SPVflagg=3, verdi 9 blir til =1.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">+ Verdi 4 betyr &laquo;Naboprikket&raquo;, og utløser ikke skjuling av serier.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- Verdi 8: Dukket opp i Skjenketidsslutt og Skjenkesteder for kommuner med tom celle i inndata. Har ikke klart å finne ut hva kodene betyr, og Kåre husker ikke/har ikke tid til å grave det fram - det var en komplisert hack for å håndtere ubalanse i Sysvak.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">+ Håndtert ved å legge følgende i KODEBOK for aktuell innlesingsspec: Tom celle i VAL1 kodes til &laquo;..&raquo; (uten gåseøyne).</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- Hvis verdien skal korrigeres til et høyere tall i min RSYNT, holder det å endre i en av de måltallkolonnene som skal leveres ut (da bruker systemet den høyeste verdien for alle ut-kolonner). Men hvis jeg skal korrigere nedover, f.eks. til SPVflagg==1, må jeg behandle alle ut-kolonnene. DET ER TRYGGEST å ta alle, uansett &#x2026;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- Erfaring: Reglene virker bare skikkelig når filen bruker standardvariablene. Se nedenfor.*</td>
</tr>

<tr>
<td class="org-left">..n</td>
<td class="org-left">Antall <i>årganger</i> tallet stammer fra (f.eks. ved glidende snitt)</td>
</tr>

<tr>
<td class="org-left">MALTALL</td>
<td class="org-left">Er en intern resultatkolonne, som kopieres til riktig ut-kolonne.  På stadiet &laquo;RSYNT_POSTPROSESS&raquo; er den ferdig brukt og overflødig, den dør like etter.</td>
</tr>

<tr>
<td class="org-left">STANDARD</td>
<td class="org-left">Dersom standardkolonnene fins, er det de som blir levert ut. Teller, Rate, Meis og SMR.</td>
</tr>

<tr>
<td class="org-left">ANDRE</td>
<td class="org-left">Sjekk i FILFILTRE. Der kan det være spesifisert mellomregninger etc. (Eks. : Vaksgrad (i Sysvak) - stå som navn på VAL1 i innlesingen, er faktisk levert vaks.dekning, men brukes i beregning av Teller spesifisert i FILFILTRE.)</td>
</tr>
</tbody>
</table>

<p>
<b>Flagg når det er spesielle variabelnavn:</b> Overfør rettinger til et av
standardflaggene!
</p>

<p>
&laquo;Vedvarende lavinntekt NH&raquo; brukte ingen av de standard
tallvariablene som har en tilhørende <b>_f</b>-variabel (teller, nevner, rate), og
dermed var heller ingen av standard <b>_f</b> -variablene i bruk (alt var missing i
disse). Det fantes et måltall <code>LAVINNT_VEDV</code>, med tilhørende <code>LAVINNT_VEDV_f</code> , men
da fungerte ikke produksjon av SPVflagg i henhold til denne flaggvariabelen.
SPVflagg ble feil, og retting i <code>LAVINNT..._f</code> i en Rsynt-Postprosess virket ikke.
</p>

<p>
<b>Jeg satte replace RATE_f = LAVINNT_VEDV_f til slutt i en Rsynt-Postprosess, og
da slo endringene inn i SPVflagg.</b>
</p>
</div>
</div>
</div>
</body>
</html>
